## Production: app
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 18 to add, 8 to change, 11 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                           NAME                            |
|----------|-----------------------------------------------------------|
| update   | `aws_iam_policy.lambda_app_invoke`                        |
|          | `aws_lambda_function.archive_form_templates`              |
|          | `aws_lambda_function.archiver`                            |
|          | `aws_lambda_function.audit_logs`                          |
|          | `aws_lambda_function.dead_letter_queue_consumer`          |
|          | `aws_lambda_function.nagware`                             |
|          | `aws_lambda_function.reliability`                         |
|          | `aws_lambda_function.submission`                          |
| recreate | `aws_ecs_task_definition.form_viewer`                     |
|          | `aws_lambda_layer_version.archive_form_templates_lib`     |
|          | `aws_lambda_layer_version.archive_form_templates_nodejs`  |
|          | `aws_lambda_layer_version.archiver_nodejs`                |
|          | `aws_lambda_layer_version.audit_logs_lib`                 |
|          | `aws_lambda_layer_version.dead_letter_queue_consumer_lib` |
|          | `aws_lambda_layer_version.nagware_lib`                    |
|          | `aws_lambda_layer_version.nagware_nodejs`                 |
|          | `aws_lambda_layer_version.reliability_lib`                |
|          | `aws_lambda_layer_version.reliability_nodejs`             |
|          | `aws_lambda_layer_version.submission_lib`                 |
| add      | `aws_cloudwatch_log_group.archive_form_templates`         |
|          | `aws_cloudwatch_log_group.archiver`                       |
|          | `aws_cloudwatch_log_group.audit_logs`                     |
|          | `aws_cloudwatch_log_group.dead_letter_queue_consumer`     |
|          | `aws_cloudwatch_log_group.nagware`                        |
|          | `aws_cloudwatch_log_group.reliability`                    |
|          | `aws_cloudwatch_log_group.submission`                     |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/forms-terraform/actions/runs/5878836708).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.lambda_app_invoke will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda_app_invoke" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:lambda:ca-central-1:957818836222:function:Submission",
            ]
        }
    }

  # data.template_file.form_viewer_task will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "form_viewer_task" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "METRIC_PROVIDER"
                          + value = "${metric_provider}"
                        },
                      + {
                          + name  = "TRACER_PROVIDER"
                          + value = "${tracer_provider}"
                        },
                      + {
                          + name  = "SUBMISSION_API"
                          + value = "${submission_api}"
                        },
                      + {
                          + name  = "NEXTAUTH_URL"
                          + value = "${nextauth_url}"
                        },
                      + {
                          + name  = "REDIS_URL"
                          + value = "${redis_url}"
                        },
                      + {
                          + name  = "RELIABILITY_FILE_STORAGE"
                          + value = "${reliability_file_storage}"
                        },
                      + {
                          + name  = "RECAPTCHA_V3_SITE_KEY"
                          + value = "${recaptcha_public}"
                        },
                      + {
                          + name  = "TEMPORARY_TOKEN_TEMPLATE_ID"
                          + value = "${gc_temp_token_template_id}"
                        },
                      + {
                          + name  = "TEMPLATE_ID"
                          + value = "${gc_template_id}"
                        },
                      + {
                          + name  = "VAULT_FILE_STORAGE"
                          + value = "${vault_file_storage}"
                        },
                      + {
                          + name  = "COGNITO_ENDPOINT_URL"
                          + value = "${cognito_endpoint_url}"
                        },
                      + {
                          + name  = "COGNITO_CLIENT_ID"
                          + value = "${cognito_client_id}"
                        },
                      + {
                          + name  = "EMAIL_ADDRESS_CONTACT_US"
                          + value = "${email_address_contact_us}"
                        },
                      + {
                          + name  = "EMAIL_ADDRESS_SUPPORT"
                          + value = "${email_address_support}"
                        },
                      + {
                          + name  = "REPROCESS_SUBMISSION_QUEUE_URL"
                          + value = "${reprocess_submission_queue}"
                        },
                      + {
                          + name  = "AUDIT_LOG_QUEUE_URL"
                          + value = "${audit_log_queue_url}"
                        },
                    ]
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + name             = "form_viewer"
                  + portMappings     = [
                      + {
                          + containerPort = 3000
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "NOTIFY_API_KEY"
                          + valueFrom = "${notify_api_key}"
                        },
                      + {
                          + name      = "RECAPTCHA_V3_SECRET_KEY"
                          + valueFrom = "${recaptcha_secret}"
                        },
                      + {
                          + name      = "GOOGLE_CLIENT_ID"
                          + valueFrom = "${google_client_id}"
                        },
                      + {
                          + name      = "GOOGLE_CLIENT_SECRET"
                          + valueFrom = "${google_client_secret}"
                        },
                      + {
                          + name      = "DATABASE_URL"
                          + valueFrom = "${database_url}"
                        },
                      + {
                          + name      = "TOKEN_SECRET"
                          + valueFrom = "${token_secret}"
                        },
                      + {
                          + name      = "GC_NOTIFY_CALLBACK_BEARER_TOKEN"
                          + valueFrom = "${gc_notify_callback_bearer_token}"
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "audit_log_queue_url"             = "https://sqs.ca-central-1.amazonaws.com/957818836222/audit_log_queue"
          + "awslogs-group"                   = "Forms"
          + "awslogs-region"                  = "ca-central-1"
          + "awslogs-stream-prefix"           = "ecs-form-viewer"
          + "cognito_client_id"               = "5rkjd3us3ocssieiitdbtjitiv"
          + "cognito_endpoint_url"            = "cognito-idp.ca-central-1.amazonaws.com/ca-central-1_eSTGTCw33"
          + "database_url"                    = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:server-database-url-jVtWGE"
          + "email_address_contact_us"        = "assistance+forms-formulaires@cds-snc.ca"
          + "email_address_support"           = "assistance+forms-formulaires@cds-snc.ca"
          + "gc_notify_callback_bearer_token" = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:gc_notify_callback_bearer_token-0zuI6O"
          + "gc_temp_token_template_id"       = "61cec9c4-64ca-4e4d-b4d2-a0e931c44422"
          + "gc_template_id"                  = "92096ac6-1cc5-40ae-9052-fffdb8439a90"
          + "google_client_id"                = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:google_client_id-7VwI9F"
          + "google_client_secret"            = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:google_client_secret-aPRebC"
          + "image"                           = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/form_viewer_production"
          + "metric_provider"                 = "stdout"
          + "nextauth_url"                    = "https://forms-formulaires.alpha.canada.ca"
          + "notify_api_key"                  = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:notify_api_key-sLtddr"
          + "recaptcha_public"                = "6LfJDN4eAAAAAGvdRF7ZnQ7ciqdo1RQnQDFmh0VY"
          + "recaptcha_secret"                = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:recaptcha_secret-LxfCjN"
          + "redis_url"                       = "gcforms-redis-rep-group.iyrckm.ng.0001.cac1.cache.amazonaws.com"
          + "reliability_file_storage"        = "forms-production-reliability-file-storage"
          + "reprocess_submission_queue"      = "https://sqs.ca-central-1.amazonaws.com/957818836222/reprocess_submission_queue.fifo"
          + "submission_api"                  = "arn:aws:lambda:ca-central-1:957818836222:function:Submission"
          + "token_secret"                    = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:token_secret-jw4Dou"
          + "tracer_provider"                 = "stdout"
          + "vault_file_storage"              = "forms-production-vault-file-storage"
        }
    }

  # aws_cloudwatch_log_group.archive_form_templates will be created
  + resource "aws_cloudwatch_log_group" "archive_form_templates" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + name              = "/aws/lambda/ArchiveFormTemplates"
      + retention_in_days = 90
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.archiver will be created
  + resource "aws_cloudwatch_log_group" "archiver" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + name              = "/aws/lambda/Archiver"
      + retention_in_days = 90
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.audit_logs will be created
  + resource "aws_cloudwatch_log_group" "audit_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + name              = "/aws/lambda/AuditLogs"
      + retention_in_days = 90
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.dead_letter_queue_consumer will be created
  + resource "aws_cloudwatch_log_group" "dead_letter_queue_consumer" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + name              = "/aws/lambda/DeadLetterQueueConsumer"
      + retention_in_days = 90
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.nagware will be created
  + resource "aws_cloudwatch_log_group" "nagware" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + name              = "/aws/lambda/Nagware"
      + retention_in_days = 90
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.reliability will be created
  + resource "aws_cloudwatch_log_group" "reliability" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + name              = "/aws/lambda/Reliability"
      + retention_in_days = 90
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_group.submission will be created
  + resource "aws_cloudwatch_log_group" "submission" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + name              = "/aws/lambda/Submission"
      + retention_in_days = 90
      + tags_all          = (known after apply)
    }

  # aws_ecs_task_definition.form_viewer must be replaced
-/+ resource "aws_ecs_task_definition" "form_viewer" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:957818836222:task-definition/form-viewer:20" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 0
                  - environment      = [
                      - {
                          - name  = "AUDIT_LOG_QUEUE_URL"
                          - value = "https://sqs.ca-central-1.amazonaws.com/957818836222/audit_log_queue"
                        },
                      - {
                          - name  = "COGNITO_CLIENT_ID"
                          - value = "5rkjd3us3ocssieiitdbtjitiv"
                        },
                      - {
                          - name  = "COGNITO_ENDPOINT_URL"
                          - value = "cognito-idp.ca-central-1.amazonaws.com/ca-central-1_eSTGTCw33"
                        },
                      - {
                          - name  = "EMAIL_ADDRESS_CONTACT_US"
                          - value = "jose.jimenez@cds-snc.ca"
                        },
                      - {
                          - name  = "EMAIL_ADDRESS_SUPPORT"
                          - value = "assistance+forms-formulaires@cds-snc.ca"
                        },
                      - {
                          - name  = "METRIC_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "NEXTAUTH_URL"
                          - value = "https://forms-formulaires.alpha.canada.ca"
                        },
                      - {
                          - name  = "RECAPTCHA_V3_SITE_KEY"
                          - value = "6LfJDN4eAAAAAGvdRF7ZnQ7ciqdo1RQnQDFmh0VY"
                        },
                      - {
                          - name  = "REDIS_URL"
                          - value = "gcforms-redis-rep-group.iyrckm.ng.0001.cac1.cache.amazonaws.com"
                        },
                      - {
                          - name  = "RELIABILITY_FILE_STORAGE"
                          - value = "forms-production-reliability-file-storage"
                        },
                      - {
                          - name  = "REPROCESS_SUBMISSION_QUEUE_URL"
                          - value = "https://sqs.ca-central-1.amazonaws.com/957818836222/reprocess_submission_queue.fifo"
                        },
                      - {
                          - name  = "SUBMISSION_API"
                          - value = "arn:aws:lambda:ca-central-1:957818836222:function:Submission"
                        },
                      - {
                          - name  = "TEMPLATE_ID"
                          - value = "92096ac6-1cc5-40ae-9052-fffdb8439a90"
                        },
                      - {
                          - name  = "TEMPORARY_TOKEN_TEMPLATE_ID"
                          - value = "61cec9c4-64ca-4e4d-b4d2-a0e931c44422"
                        },
                      - {
                          - name  = "TRACER_PROVIDER"
                          - value = "stdout"
                        },
                      - {
                          - name  = "VAULT_FILE_STORAGE"
                          - value = "forms-production-vault-file-storage"
                        },
                    ]
                  - essential        = true
                  - image            = "957818836222.dkr.ecr.ca-central-1.amazonaws.com/form_viewer_production"
                  - linuxParameters  = {
                      - capabilities = {
                          - drop = [
                              - "ALL",
                            ]
                        }
                    }
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "Forms"
                          - awslogs-region        = "ca-central-1"
                          - awslogs-stream-prefix = "ecs-form-viewer"
                        }
                    }
                  - mountPoints      = []
                  - name             = "form_viewer"
                  - portMappings     = [
                      - {
                          - containerPort = 3000
                          - hostPort      = 3000
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets          = [
                      - {
                          - name      = "NOTIFY_API_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:notify_api_key-sLtddr"
                        },
                      - {
                          - name      = "RECAPTCHA_V3_SECRET_KEY"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:recaptcha_secret-LxfCjN"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_ID"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:google_client_id-7VwI9F"
                        },
                      - {
                          - name      = "GOOGLE_CLIENT_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:google_client_secret-aPRebC"
                        },
                      - {
                          - name      = "DATABASE_URL"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:server-database-url-jVtWGE"
                        },
                      - {
                          - name      = "TOKEN_SECRET"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:token_secret-jw4Dou"
                        },
                      - {
                          - name      = "GC_NOTIFY_CALLBACK_BEARER_TOKEN"
                          - valueFrom = "arn:aws:secretsmanager:ca-central-1:957818836222:secret:gc_notify_callback_bearer_token-0zuI6O"
                        },
                    ]
                  - volumesFrom      = []
                },
            ] # forces replacement
        ) -> (known after apply)
      ~ id                       = "form-viewer" -> (known after apply)
      ~ revision                 = 20 -> (known after apply)
        tags                     = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (9 unchanged attributes hidden)
    }

  # aws_iam_policy.lambda_app_invoke will be updated in-place
  ~ resource "aws_iam_policy" "lambda_app_invoke" {
        id          = "arn:aws:iam::957818836222:policy/lambda_app_invoke"
        name        = "lambda_app_invoke"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ca-central-1:957818836222:function:Submission"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_lambda_function.archive_form_templates will be updated in-place
  ~ resource "aws_lambda_function" "archive_form_templates" {
        id                             = "ArchiveFormTemplates"
      ~ last_modified                  = "2023-06-19T15:32:00.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:957818836222:layer:archive_form_templates_lib_packages:1",
          - "arn:aws:lambda:ca-central-1:957818836222:layer:archive_form_templates_node_packages:3",
        ] -> (known after apply)
      ~ source_code_hash               = "hnxlZxxv2yMpRiU2heu1IEjtP7oUET2AuVuU080nMrY=" -> "X/5IZ2OGKUQN37O1Tmg8PkYLrDM/SAqY03rH0V1L2kI="
        tags                           = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.archiver will be updated in-place
  ~ resource "aws_lambda_function" "archiver" {
        id                             = "Archiver"
      ~ last_modified                  = "2023-06-19T15:31:48.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:957818836222:layer:archiver_lib_packages:1",
          - "arn:aws:lambda:ca-central-1:957818836222:layer:archiver_node_packages:6",
        ] -> (known after apply)
      ~ source_code_hash               = "hLD1VyqKvQbwDSWFL9xJSY0DUcLlim2/1ndj+Pn6Mxg=" -> "vwHjhQrsPx8fZZidqMjPr3SW1xFf6m7PhHc0MazA8sg="
        tags                           = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "SNS_ERROR_TOPIC_ARN"          = "arn:aws:sns:ca-central-1:957818836222:alert-critical" -> null
                # (4 unchanged elements hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.audit_logs will be updated in-place
  ~ resource "aws_lambda_function" "audit_logs" {
        id                             = "AuditLogs"
      ~ last_modified                  = "2023-06-19T15:31:47.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:957818836222:layer:audit_logs_node_packages:3",
        ] -> (known after apply)
      ~ source_code_hash               = "mQxl9VyA225PSewrwN8mLiOZ88cPwt8x7u+sHaB61sw=" -> "L0huilf9W9wqyXvWG8qNvrLEBYUOyWugGVxyaDbnrvE="
        tags                           = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "SNS_ERROR_TOPIC_ARN" = "arn:aws:sns:ca-central-1:957818836222:alert-critical" -> null
                # (1 unchanged element hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.dead_letter_queue_consumer will be updated in-place
  ~ resource "aws_lambda_function" "dead_letter_queue_consumer" {
        id                             = "DeadLetterQueueConsumer"
      ~ last_modified                  = "2023-06-19T15:31:41.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:957818836222:layer:dead_letter_queue_consumer_node_packages:4",
        ] -> (known after apply)
      ~ source_code_hash               = "foRV3lpc4SINNhjayLX6INifc2STyOWRNaFtpkd3TVU=" -> "uV05fLdwJgyju+RtKBJLit17CJw0rAi5sUYyQtEYe1Q="
        tags                           = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.nagware will be updated in-place
  ~ resource "aws_lambda_function" "nagware" {
        id                             = "Nagware"
      ~ last_modified                  = "2023-06-19T15:32:09.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:957818836222:layer:nagware_lib_packages:3",
          - "arn:aws:lambda:ca-central-1:957818836222:layer:nagware_node_packages:3",
        ] -> (known after apply)
      ~ source_code_hash               = "1lkuh9DDwBCy2u7F8o99BFbRx4RLeIJBsnfZSA30Q+8=" -> "iEcgvvidpFH4l1y2zkp2weM9newMLuhW5SACT1opKjk="
        tags                           = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.reliability will be updated in-place
  ~ resource "aws_lambda_function" "reliability" {
        id                             = "Reliability"
      ~ last_modified                  = "2023-06-19T15:31:29.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:957818836222:layer:reliability_lib_packages:16",
          - "arn:aws:lambda:ca-central-1:957818836222:layer:reliability_node_packages:33",
        ] -> (known after apply)
      ~ source_code_hash               = "t+G8MFgtikOTRdsRP0aYBZ4OuDIznmWAjqNqKUwa5r4=" -> "ecKX+iXqfZ1zK13uaEKzYkSwpWxRHPzGKm9tBcWejwg="
        tags                           = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.submission will be updated in-place
  ~ resource "aws_lambda_function" "submission" {
        id                             = "Submission"
      ~ last_modified                  = "2023-06-19T15:32:06.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ca-central-1:957818836222:layer:submission_node_packages:21",
        ] -> (known after apply)
      ~ source_code_hash               = "hSCfbKw7q4M+8gD0yMwbyj0sokLcpx3x9zmhk0kCWVc=" -> "q/+pOrWiAE/H9/h9VmzMyUx9E0075hNNF6JI6diB34w="
        tags                           = {
            "CostCentre" = "forms-platform-production"
            "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_lambda_layer_version.archive_form_templates_lib must be replaced
-/+ resource "aws_lambda_layer_version" "archive_form_templates_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:957818836222:layer:archive_form_templates_lib_packages:1" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-04-28T12:07:53.376+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:957818836222:layer:archive_form_templates_lib_packages:1" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:957818836222:layer:archive_form_templates_lib_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "sJbaO6Ury4AeD8hZC7rT5XJ1qzzVQFJoL6uRYKXZ0qw=" -> "Wcj95c2XyEFG8Xs6C4qfO3t2Leg5zjBkiyF1MxJxOSo=" # forces replacement
      ~ source_code_size            = 1321 -> (known after apply)
      ~ version                     = "1" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.archive_form_templates_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "archive_form_templates_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:957818836222:layer:archive_form_templates_node_packages:3" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-06-19T15:31:59.714+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:957818836222:layer:archive_form_templates_node_packages:3" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:957818836222:layer:archive_form_templates_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "QomxpGKEye2uPjHF8h9CaZIo6KG9LMtzNOqu1suwaNQ=" -> "YmVzpiq+4Xh0RKDevKf5FtOl/i6pD2+DgsZqRbBoyUE=" # forces replacement
      ~ source_code_size            = 2340296 -> (known after apply)
      ~ version                     = "3" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.archiver_nodejs must be replaced
-/+ resource "aws_lambda_layer_version" "archiver_nodejs" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:957818836222:layer:archiver_node_packages:6" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-06-19T15:31:47.515+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ca-central-1:957818836222:layer:archiver_node_packages:6" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ca-central-1:957818836222:layer:archiver_node_packages" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "vC7Z5E6UgpqUPq7IITL5w8KkmhfS3VyC8C7UePY6X1Y=" -> "PSgOj/N85QqdzFMI/PSu5FlY7y6g+/RYkB/3pqDjnKI=" # forces replacement
      ~ source_code_size            = 5076290 -> (known after apply)
      ~ version                     = "6" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_layer_version.audit_logs_lib must be replaced
-/+ resource "aws_lambda_layer_version" "audit_logs_lib" {
      ~ arn                         = "arn:aws:lambda:ca-central-1:957818836222:layer:audit_logs_node_packages:3" -> (known after apply)
      - compatible_architectures...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_2am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_3am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_4am_every_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.cron_5am_every_business_day"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]

28 tests, 17 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
